"""
2. Закодируйте любую строку из трех слов по алгоритму Хаффмана.
 """

import task_8_1

if __name__ == '__main__':
    line = task_8_1.__doc__[3:35]
    alphabet = [' ', 'Ё']
    alphabet.extend([chr(symb) for symb in range(1040, 1106)])
    for quant in alphabet:
        sum_sym = 0
        for line_sym in line:
            if line_sym == quant:
                sum_sym += 1
        if sum_sym:
            print(quant, ':', sum_sym)
'''
строка: "Определение количества различных" по частоте символов:
' ': 2
О : 1
а : 2
в : 1
д : 1
е : 5
з : 1
и : 3
к : 1
л : 3
н : 2
о : 1
п : 1
р : 2
с : 1
т : 1
х : 1
ч : 2
ы : 1

1 уровень частоты (5): е
2 уровень частоты (3): ли
3 уровень частоты (2): ч рнка
4 уровень частоты (1): хыстопкздвО

e:  1
ли, ч' 'рика:       1           хыстопкздвО: 0
ли: 11    ч' 'рика: 10          х:           00
л:  110   ч:        100         ыстопкздвО:  01
и:  111   ' 'рика:  101         ы:           010
          ' ':      1010        стопкздвО:   011
          рика:     1011        с:           0110
          р:        10110       топкздвО:    0111
          ика:      10111       т:           01110
          и:        101110      опкздвО:     01111
          ка:       101111      о:           011110    
          к:        1011110     пкздвО:      011111
          а:        1011111     п:           0111110 
                                кздвО:       0111111
                                к:           01111110
                                здвО:        01111111
                                з:           011111110
                                двО:         011111111
                                д:           0111111110
                                вО:          0111111111
                                О:           01111111110

Строка:
01111111110 0111110 10110 1 0111111110 1 110 1 111 101110 1 1010 1011110 011110 110 111 100 1 0110
01110 01111111111 1011111 1010 10110 1011111 011111110 110 101110 10 111 010 00
'''
